/* 
Объявление переменной
*/
//Верное объявление переменной

// let age;
// let info123;
// let $size;
// let _color;

//Ошибочное объявление

// let 123info;
// let my-age;

/*


Для объявление переменной, используется стиль CamelCase
"ГорбатыйРегистр", "ВерблюжийРегистр"

Стиль lowerCamelCase

первоеВтороеТретьеСлово пишется с верхнего регистра
*/

//Регистр имеет значение

// let sidebarsize;
// let sidebarSize;

//Объявление переменной и присвоение значения
//let myLifeStyle = 'freelance';
//пусть мой образ жизни будет фриланс
//console.log(myLifeStyle);

//Область видимсоти переменных

//пример блока инструкций
function testBlock(){
	console.log('Учим');
	console.log('Js');
}
testBlock();//запустил переменную